In [1]:
import pandas as pd
data={
'department':['sales','sales','hr','hr','it'],
'employee':['alice','bob','charlie','kiran','krish'],
'salary':[1234345,2312234,123454322,2344524,2345555]
}
df=pd.DataFrame(data)
grouped=df.groupby('department')['salary'].mean()
print(grouped)

department
hr       62899423.0
it        2345555.0
sales     1773289.5
Name: salary, dtype: float64

In [5]:
df1=pd.DataFrame({
    'empid':[1,2,3],
'name':['alice','bob','charlie']
})
df2=pd.DataFrame({
'empid':[1,2,4],
'dept':['sales','hr','it']
})
merged=pd.merge(df1,df2,on='empid',how='inner')
merged

   empid   name   dept
0      1  alice  sales
1      2    bob     hr

In [10]:
import pandas as pd
df1=pd.DataFrame({
    'empid':[1,2,3],
'name':['alice','charlie','bob']
})
df2=pd.DataFrame({
'empid':[1,2,3],
'dept':['sales','hr','it']
})
merged=pd.merge(df1,df2,on='empid',how='inner')
merged

   empid     name   dept
0      1    alice  sales
1      2  charlie     hr
2      3      bob     it

In [11]:
df1=pd.DataFrame({
    'name':['alice','bob','charlie']
},index=[1,2,3])
df2=pd.DataFrame({
    'dept':['sales','hr','it']
},index=[1,2,4])
joined=df1.join(df2)
joined

      name   dept
1    alice  sales
2      bob     hr
3  charlie    NaN

In [12]:
df1=pd.DataFrame({
    'name':['alice','bob','charlie']
},index=[1,2,3])
df2=pd.DataFrame({
    'dept':['sales','hr','it']
},index=[1,2,3])
joined=df2.join(df1)
joined

    dept     name
1  sales    alice
2     hr      bob
3     it  charlie

In [15]:
df1=pd.DataFrame({
    'name':['kiran','krish','bob']
},index=[1,2,3])
df2=pd.DataFrame({
    'dept':['sales','it','hr']
},index=[1,2,4])
joined=df2.join(df1)
joined

    dept   name
1  sales  kiran
2     it  krish
4     hr    NaN

In [17]:
df1=pd.DataFrame({'a':[1,2],'b':[3,4]})
df2=pd.DataFrame({'a':[5,6],'b':[7,8]})
result=pd.concat([df1,df2],axis=1)
result

   a  b  a  b
0  1  3  5  7
1  2  4  6  8

In [19]:
df1=pd.DataFrame({'a':[1,2],'b':[3,4]})
df2=pd.DataFrame({'a':[5,6],'b':[7,8]})
result=pd.concat([df1,df2])
result

   a  b
0  1  3
1  2  4
0  5  7
1  6  8

In [22]:
data={
    'dept':['sales','sales','hr','hr','it'],
    'employee':['alice','bob','kiran','krish','john'],
    'salary':[1234,3455,6789,5432,45635]
}
df=pd.DataFrame(data)
grouped=df.groupby('dept')['salary'].mean()
grouped

dept
hr        6110.5
it       45635.0
sales     2344.5
Name: salary, dtype: float64